# GetRepresentations Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGeometryInfo..::..GetRepresentations Method
IFCGeometryInfo Class See Also
---
Gets the representation handles created representing the processed geometry and stored in this object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetRepresentations()
```

Visual Basic
---
```text
Public Function GetRepresentations As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetRepresentations()
```

# ### Return Value
The collection of representation handles.
# See Also
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace